loadtest.yaml
modules:
  blazemeter:
    token: f20fb0c1a7d1c72a9736c749:7f75d1962f11f365dd59f04d27616a331dd208b7d3d43d26bd3ed69ed7d67435bbe1d0cb
    address: https://a.blazemeter.com  # reporting service address
    data-address: https://data.blazemeter.com  # data service address
    browser-open: start  # auto-open the report in browser,
                         # can be "start", "end", "both", "none"
    send-interval: 30s   # send data each n-th second
    report-times-multiplier: 1000  # multiplying factor for response times, advanced option
    timeout: 5s  # connect and request timeout for BlazeMeter API
    artifact-upload-size-limit: 5  # limit max size of file (in megabytes)
                                   # that goes into zip for artifact upload, 10 by default
    public-report: false  # set to true to create a public link to the report
    request-logging-limit: 10240 # use this to dump more of request/response data into logs, for debugging

    # following instructions will have effect when no per-reporter settings
    report-name: VSC Example
    test: VSC Example
    project: Default



execution:
  - scenario: default-scenario
    hold-for: 3m
    ramp-up: 1m
    concurrency: 2
    locations:
      us-east4-a: 5
    steps: 0

scenarios:
  default-scenario:
    requests:
      - url: https://www.dbankdemo.com
        method: GET
        label: Login
      - url: https://www.dbankdemo.com?id=${id}
        method: GET
        label: DigitalBank
    retrieve-resources: false
    
    data-sources: # list of external data sources
    - path: csvdata.csv  # this is a full form
      delimiter: ','
      quoted: false
      encoding: "utf-8"
      loop: true
      variable-names: id,name
      random-order: false